_Rarzrabotki/Rarus/USO2/ExchangePlans/СМ_WS_Обмен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<ExchangePlan>
		<Properties>
			<Name>СМ_WS_Обмен</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>URL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентноеЗаданиеGUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьРегламентноеЗадание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаВыгрузкиДокументов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьОбъектыСтроительства</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьКонтрагентовИДоговоры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьНоменклатуру</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьЦеныРесурсов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьАкты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыРесурсов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРесурса</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СМ_ВидыРесурсов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_WS_БуферЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_WS_БуферЗагрузки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПредставлениеОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеОбъекта1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧисловойПараметр1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДанныеОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_Ресурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GUIDПроекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/ExchangePlans/СМ_WS_Обмен/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Функция возвращает массив узлов плана обмена
//
// Возвращаемое значение:
//     Массив - содержит ссылки на узлы плана обмена.
//
Функция ПолучитьУзлы() Экспорт
	
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= "
	|ВЫБРАТЬ
	|	СМ_WS_Обмен.Ссылка КАК Ссылка
	|ИЗ
	|	ПланОбмена.СМ_WS_Обмен КАК СМ_WS_Обмен
	|ГДЕ
	|	СМ_WS_Обмен.Ссылка <> &ТекущийУзел И
	|	СМ_WS_Обмен.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("ТекущийУзел", ПланыОбмена.СМ_WS_Обмен.ЭтотУзел());
	
	ТаблицаЗначений = Запрос.Выполнить().Выгрузить();
	МассивУзлов = ТаблицаЗначений.ВыгрузитьКолонку("Ссылка");
	
	Возврат МассивУзлов;
	
КонецФункции // ПолучитьУзлы()

// Делает запрос к веб-сервису и получает данные
//
// Параметры:
//    Данные 		 - Структура - содержит необходимые данные.
//	  АдресХранилища - Строка - адрес во временном хранилище.
//
Процедура ЗапроситьДанныеССервиса(Данные,АдресХранилища) Экспорт
	
	Попытка
		Определения = Новый WSОпределения("http://"+Данные.URL+"/ws/wsbp.1cws?wsdl", Данные.Логин, Данные.Пароль);
	Исключение
		АдресХранилища = ПоместитьВоВременноеХранилище(Новый Структура("Текст","Не удалось подключится к веб-сервису"), АдресХранилища);
		Возврат;
	КонецПопытки;
	Попытка
		Прокси = Новый WSПрокси(Определения, "BP_WS_DataIntegration", "BP_WS_DataIntegration", "BP_WS_DataIntegrationSoap");
		Прокси.Пользователь=Данные.Логин;
		Прокси.Пароль=Данные.Пароль;
	Исключение
		АдресХранилища = ПоместитьВоВременноеХранилище(Новый Структура("Текст","Не удалось подключится к веб-сервису"), АдресХранилища);
		Возврат;
	КонецПопытки;
	
	ПередачаНеЗавершена=Истина;
	
	СтДляПередачи=Новый Структура("ТипОбъекта,Код,НомерСообщения,СтартНм,СтартТип",Данные.ТипОбъекта,Данные.Узел.Код,0,"","");
	
	Пока ПередачаНеЗавершена Цикл
		
		ДляПередачи=Новый ХранилищеЗначения(СтДляПередачи);	
		Хранилище=Прокси.GetDataList(ДляПередачи);
		ДанныеХранилища=Хранилище.Получить();
		
		Если ДанныеХранилища.Таблица.Количество()=0 Тогда
			ПередачаНеЗавершена=Ложь;
			Прервать;
		КонецЕсли;	
		Для Каждого Эл Из ДанныеХранилища.Таблица Цикл
			СтДляПередачи.СтартНм=Эл.GUID;
			СтДляПередачи.СтартТип=Эл.ТипОбъекта;
			
			Запись=РегистрыСведений.СМ_WS_БуферЗагрузки.СоздатьМенеджерЗаписи();
			Запись.ИдентификаторБазы=Данные.ИдентификаторБазы;
			Запись.GUID=Эл.GUID;
			Запись.Пользователь=Данные.ТекущийПользователь;
			Запись.ТипОбъекта=Данные.ТипОбъекта;
			Запись.ПредставлениеОбъекта=Эл.Представление;
			Запись.ПредставлениеОбъекта1=Эл.ПредставлениеКод;
			Запись.ДанныеОбъекта=Эл.ДанныеОбъекта;
			Запись.Записать();
			
		КонецЦикла;
		
	КонецЦикла;
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Новый Структура("Текст","загрузка завершена"), АдресХранилища);	
	
КонецПроцедуры

#КонецОбласти
